# -*- coding：utf-8 -*-#

# --------------------------------------------------------------
# NAME:          11
# Description:   常用算法
# Author:        xuezy
# Date:          2020/11/27 19:42
# --------------------------------------------------------------


def qjf():
    """
    穷举法 - 又称为暴力破解法， 对所有的可能性进行验证， 直到找到正确答案
    :return:
    """
    # 公鸡5元一只 母鸡3元一只 小鸡1元一只
    # 用100元买100只鸡 问公鸡、母鸡和小鸡各多少只
    for x in range(20):
        for y in range(33):
            z = 100 - x - y
            if 5*x + 3*y + z // 3 == 100 and z %3 == 0:
                print(x, y, z)