# -*- coding：utf-8 -*-#

# --------------------------------------------------------------
# NAME:          for
# Description:   for循环
# Author:        xuezy
# Date:          2020/6/19 17:17
# --------------------------------------------------------------

"""
for循环实现1~100求和
range(101)      可以产生一个0~100的整数序列
range(1,100)    可以产生一个1~99的整数序列
range(1,100,2)  可以产生一个1~99的奇数序列，2是步长，即增量
"""
sum = 0
for x in range(101):
    sum += x
print(sum)

"""
1~100间的偶数和
"""
sum1 = 0
for y in range(0, 101, 2):
    sum1 += y
print(sum1)

"""
1~100之间的奇数和
"""
sum2 = 0
for z in range(1, 100, 2):
    sum2 += z
print(sum2)
