# -*- coding：utf-8 -*-#

# --------------------------------------------------------------
# NAME:          03
# Description:   使用变量保存数据并进行算术运算
# Author:        xuezy
# Date:          2020/6/16 16:22
# --------------------------------------------------------------

a = 123
b = 321
print('a + b = ', a + b)
print('a - b = ', a - b)
# *  代表乘法
print('a * b = ', a * b)
# " / "表示浮点数除法，返回浮点float结果
print('a / b = ', a / b)
# " // "表示整数除法,返回一个不大于" / "计算结果的最大整数int
print('a // b = ', a // b)
print('a % b = ', a % b)
# ** 代表乘方
print('a ** b = ', a ** b)

print(3//2)