# -*- coding：utf-8 -*-#

# --------------------------------------------------------------
# NAME:          01
# Description:   寻找水仙花数：水仙花数是指一个 3 位数，它的每个位上的数字的 3次幂之和等于它本身（例如：1^3 + 5^3+ 3^3 = 153）
# Author:        xuezy
# Date:          2020/6/24 14:28
# --------------------------------------------------------------
sxhList = []

for i in range(100, 999):
    # 百位数
    x = int(i / 100)
    # 十位数
    y = int((i - x * 100) / 10)
    # 个位数
    z = (i - x * 100 - y * 10)
    # 判断是否为水仙花数
    if (x ** 3 + y ** 3 + z ** 3) == i:
        sxhList.append(i)
print('水仙花数为：', sxhList)
