# -*- coding：utf-8 -*-#

# --------------------------------------------------------------
# NAME:          03
# Description:   百钱百鸡问题：鸡翁（公鸡）一值钱五，鸡母（母鸡）一值钱三，鸡雏（小鸡）三值钱一。百钱买百鸡，问鸡翁、鸡母、鸡雏各几何？
#                公鸡：x   母鸡：y
#                5x + 3y + (100 - x - y) / 3 = 100
#                7x + 4y = 100
# Author:        xuezy
# Date:          2020/6/24 15:46
# --------------------------------------------------------------
for x in range(0, 100):
    for y in range(0, 100):
        if 7 * x + 4 * y == 100 and 100 - x - y >= 0:
            print('公鸡%d只，母鸡%d只，小鸡%d只。' % (x, y, 100 - x - y))
