# -*- coding：utf-8 -*-#

# --------------------------------------------------------------
# NAME:          04
# Description:   生成“斐波那契数列”
# 因数学家列昂纳多·斐波那契（Leonardoda Fibonacci）以兔子繁殖为例子而引入，故又称为“兔子数列”，
# 指的是这样一个数列：1、1、2、3、5、8、13、21、34、……在数学上，
# 斐波那契数列以如下被以递推的方法定义：F(1)=1，F(2)=1, F(n)=F(n - 1)+F(n - 2)（n ≥ 3，n ∈ N*）
# Author:        xuezy
# Date:          2020/6/24 16:09
# --------------------------------------------------------------
sz = [1, 1]
for i in range(1, 100):
    szLen = sz.__len__()
    tempa = sz[szLen - 1]
    tempb = sz[szLen - 2]
    if tempa + tempb == i:
        sz.append(i)

print('1~100之间的兔子数列为：', sz)
